export const BOARD_WIDTH = 10;
export const BOARD_HEIGHT = 10;
export const BLOCKS_TO_GENERATE = 3;
export const HIGH_SCORE_STORAGE_KEY = "1010-high-score";
export const LINES_FOR_LEVEL_UP = 10;

export const BLOCK_SHAPES: (0 | 1)[][][] = [
  [[1]],
  [
    [1, 1],
    [1, 1],
  ], // 2x2
  [
    [1, 1, 1],
    [1, 1, 1],
    [1, 1, 1],
  ],
  [[1, 1]], // 2x1
  [[1, 1, 1]], // 1x3
  [[1, 1, 1, 1]], // 4x1
  [[1], [1]], // 1x2
  [[1], [1], [1]], // 3x1
  [[1], [1], [1], [1]], // 1x4
  [
    [1, 1, 1],
    [0, 1, 0],
  ],
  [
    [0, 1, 0],
    [1, 1, 1],
  ],
  [
    [0, 1],
    [1, 1],
    [0, 1],
  ],
  [
    [1, 0],
    [1, 1],
    [1, 0],
  ],
  [
    [1, 1, 0],
    [0, 1, 1],
  ],
  [
    [0, 1, 1],
    [1, 1, 0],
  ],
  [
    [1, 0],
    [1, 1],
  ], // ㄴ
  [
    [0, 1],
    [1, 1],
  ], // 반대 ㄴ
  [
    [1, 1, 1],
    [1, 0, 0],
  ],
  [
    [1, 1, 1],
    [0, 0, 1],
  ],
];
